tap "bigwig-club/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "caddy"
brew "commitizen"
brew "eza"
brew "fd"
brew "fnm"
brew "git"
brew "neofetch"
brew "onefetch"
brew "pyenv"
brew "pyenv-virtualenv"
brew "starship"
brew "zoxide"
cask "adrive"
cask "bitwarden"
cask "figma"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome-dev"
cask "imageoptim"
cask "input-source-pro"
cask "keka"
cask "logi-options-plus"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "neteasemusic"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "pictureview"
cask "pycharm"
cask "raycast"
cask "shottr"
cask "spotify"
cask "telegram"
cask "tencent-meeting"
cask "ticktick"
cask "todesk"
cask "upic"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webstorm"
cask "wechat"
vscode "alefragnani.project-manager"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "atomiks.moonlight"
vscode "be5invis.toml"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "mikestead.dotenv"
vscode "mpontus.tab-cycle"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-python.autopep8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "Nuxt.mdc"
vscode "Prisma.prisma"
vscode "richie5um2.vscode-sort-json"
vscode "sainnhe.gruvbox-material"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "techer.open-in-browser"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "voorjaar.windicss-intellisense"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WakaTime.vscode-wakatime"
vscode "yaelguilloux.pinceau-vscode"
vscode "ZixuanChen.vitest-explorer"
vscode "znck.grammarly"
