tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple Node.js versions
brew "nvm"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Cross-shell prompt for astronauts
brew "starship"
# Internet file retriever
brew "wget"
# Cloud storage service
cask "baidunetdisk"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Chinese typeface seeking a visual balance between the humanist and the geometric
cask "font-smiley-sans"
# Web browser
cask "google-chrome"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Mango TV video app
cask "imgotv"
# Music streaming platform
cask "neteasemusic"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Tool for uploading images
cask "picgo"
# Interactive media player
cask "qiyimedia"
# Tencent video streaming and sharing platform
cask "qqlive"
# Chinese music streaming application
cask "qqmusic"
# Control your tools with a few keystrokes
cask "raycast"
# Input method supporting full and double spelling
cask "sogouinput"
# Music streaming service
cask "spotify"
# App to switch hosts
cask "switchhosts"
# Cleanup and system status tool
cask "tencent-lemon"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Free messaging and calling application
cask "wechat"
# Chinese video streaming and sharing platform
cask "youku"
